{
  "Templates": {
    "Greeting": [ "General", "Hi there! Thank you for contacting us. I'm {Agent Name}, and I'll be assisting you today. Please allow me a moment to review what has been said so far." ],
    "Anything Else": [ "General", "Is there anything else I can help you with, or do you have any other questions I may be able to answer?" ],
    "Survey": [ "General", "Then I'd like to thank you very much for contacting us today! It has been a pleasure to help you. After I close this conversation, could you kindly fill out the survey that pops up? It should take you no more than 15 seconds or so :)" ],
    "Stall 1": [ "General", "Just so you know that I haven't left, I'm collecting as much information as I can and will be back with you as soon as possible." ],
    "Stall 2": [ "General", "Thank you for waiting! I'm still looking into it but I will be back with you shortly." ],
    "DNE": [ "General", "Thank you for reaching out and letting us know your thoughts on the situation. Our team responsible for this is already aware of what's happening, but for now we don't have any more information to share. But do let me know if you need help with anything else!" ],
    "Before Refund": [ "General", "Okay, I can refund your latest payment! Do note that this will automatically revert your account to free as well—is that okay with you?" ],
    "After Refund": [ "General", "Alright, it has been refunded and will be processed by your bank as soon as they are able to! Is there anything else I can help you with?" ],
    "Trial Expired": [ "General", "I've taken a quick look backstage and I can see you used a free trial—no payment was taken during that time as part of the offer, but since this is a monthly subscription and it had not been cancelled, the system automatically collecting the next month's payment from you, which is why you're seeing that charge." ],
    "Other Emails": [ "General", "While I go investigate, if you could check for me to see if you have any other email addresses that may be associated with a Spotify account, please let me know." ],
    "Secure Form": [ "General", "I think our best bet would be for me to send you a secure, encrypted form where you can enter some of the details of the card that has been charged, which will allow me to go look for the transaction in the system—is this okay with you?" ],
    "Why Secure Form?": [ "General", "Of course, allow me to clarify! When someone uses a credit or debit card to purchase a subscription with us, the payment details are linked to that person's account but we have no way to know that person's email, username, or any other account identifiers to search backstage in advance. So, in order to locate the account the charges are coming from, and refund them (which will block future charges), we need to search for payment details.\\n\\nI understand you might feel uncertain about sharing such details with me, but I assure you that I will never ask you for a full card number or anything that would put you at risk. The Secure Form is only visible to me and it only requires a partial card number. The reason I send it in a form is so that all traces of it can be fully erased once the conversation is over, so there is absolutely nothing to worry about :)" ],
    "GDPR": [ "General", "We’re happy to share what personal data we retain about you. You should receive an email to verify your request to download your data. If you haven’t received it yet, be sure to check your spam/junk folders. Once you confirm the request we’ll email you a copy of your data." ],
    "Contact Bank": [ "General", "I can see that the system is trying to process the transaction, but receives no response from the bank. We can try it again using an incognito window to see if it's due to a form—submit error caused by faulty cache, but the best might be to ask the bank if they have any restrictions in place on recurring payments or online transactions" ],
    "Close Acc": [ "General", "Absolutely, I can go ahead and send a verification email to the associated email address which will let you close your account—it will then be entirely deleted from the system in 3—4 weeks, is that okay with you?" ],
    "Left Solved": [ "General", "As it looks like the problem has been resolved, I'll go ahead and close the conversation now—if anything else pops up, please feel free to reach out to us again! " ],
    "Escalate": [ "General", "Okay, I've collected everything you've said and provided, and everything I could find—I can transfer you to a specialized department that will be able to help you further, and pass along all the information so that you do not have to repeat yourself, if that's okay with you?" ],
    "Account Transfer": [ "General", "Sure thing! Here’s what we can transfer:\\n\\n- Saved music\\n- Playlists\\n- Followers\\n- Notification settings\\n- Any personal details registered, e.g. your date of birth\\n\\nIt's worth noting that for security reasons, we can only perform 1 account transfer per person, and that the transfer will not include:\\n\\n- Artists/people you follow\\n- Your listening history\\n\\nSo playlists made for you like Discover Weekly and Daily Mix will start fresh on your new account, is that okay with you?" ],
    "Gift Card": [ "General", "I can definitely look into that for you. Could you provide me with a photo of the front and the back of your Gift Card so I can go ahead and look for it in the system?" ],
    "Links": [ "General", "Account Overview\\nhttps://www.spotify.com/account/overview\\n\\nReset Password\\nhttp://www.spotify.com/password-reset\\n\\nAnonymous Support\\nhttps://support.spotify.com/us/contact-spotify-anonymous/\\n\\nSupport email\\nsupport@spotify.com\\n\\nPodcast Support\\nhttps://support.spotifyforpodcasters.com/hc/en-us/requests/new\\n\\nArtist Support\\nhttps://artists.spotify.com/contact\\n\\nWeb Player\\nhttps://open.spotify.com\\n\\nStudent Discount\\nwww.spotify.com/student/\\n\\nReport content\\nhttps://support.spotify.com/content-policy-reporting/\\n\\nPremium without trial\\nhttps://www.spotify.com/purchase/panel/no-trial/\\n\\nLink to invite/remove member\\nhttps://support.spotify.com/us/article/invite-remove-family-member/\\n\\nManual Verification SheerID\\nhttps://spotify-international.sheerid.com/\\n\\nSpotify minimum requirements\\nhttps://support.spotify.com/br/article/spotify-system-requirements/\\n\\nLink to check past charges\\nhttps://www.spotify.com/account/subscription/receipt/\\n\\nHow to close account\\nhttps://support.spotify.com/us/article/close-account/\\n\\nHow to change payment method\\nhttps://support.spotify.com/us/article/update-payment-details/" ],
    "Free": [ "Verification", "Alright, I've located your account, I just need to verify you as the owner of it before we can continue I'll just need to ask you for a bit of information to verify you as the owner of it.\\n\\n\\nCould you kindly tell me the Make, Model, and Operating system of a device you've recently used your Spotify account with?\\n\\nCan you name me a song you recently liked, oh and the artist as well?\\n\\nDo you remember the name of a secret/private playlist on your account?" ],
    "Premium": [ "Verification", "Alright, I've located your account, I just need to verify you as the owner of it before we can continue I'll just need to ask you for a bit of information to verify you as the owner of it.\\n\\n\\nCould you see if you can find the merchant reference of a Spotify payment you made recently? These usually start with P0 or P1 and can be found in the details of the transaction on your bank statement, or PayPal purchase depending on which you used\\n\\nCan you tell me the last 4 digits of the card you used to pay for your subscription?\\n\\nCan you provide me with a screenshot of a recent Spotify transaction? (Please make sure to not include any full card details for your own security)" ],
    "Partner": [ "Verification", "Alright, I've located your account, I just need to verify you as the owner of it before we can continue I'll just need to ask you for a bit of information to verify you as the owner of it.\\n\\n\\nCould you kindly tell me the Make, Model, and Operating system of a device you've recently used your Spotify account with?\\n\\nCan you name me a song you recently liked, oh and the artist as well?\\n\\nDo you remember the name of a secret/private playlist on your account?" ],
    "ATO": [ "Verification", "Alright, I've located your account, I just need to verify you as the owner of it before we can continue I'll just need to ask you for a bit of information to verify you as the owner of it;\\n\\n\\nCan you provide me with a screenshot of a recent Spotify transaction? (Please make sure to not include any full card details for your own security)\\n\\nCould you get me the oldest receipt you have available for a Spotify transaction you've made?" ],
    "Chargeback": [ "Verification", "Alright, I've located your account, I just need to verify you as the owner of it before we can continue I'll just need to ask you for a bit of information to verify you as the owner of it;\\n\\n\\nCan you provide me with the last four digits of the card that the chargeback was issued on?" ],
    "Reinstall Android": [ "Tech", "The issues you're describing sound like a problem with the cached or temporary data on your device, which can sometimes get damaged over time. I think our best bet would be to do a bit of a specific reinstall of the app that clears out all this data, which is sort of like making the situation brand new again. To do so, you can simply\\n\\n1. From the Android home screen, tap Settings > Apps.\\n2. Find Spotify in your list of apps and tap on it.\\n3. Select Storage & Cache.\\n4. Select Clear Storage.\\n5. Once done, go back and select Uninstall.\\n6. Open a File Manager (there should be a default app on your phone, but the name can vary) and navigate to Internal Storage > Android > data.\\n7. If you see a folder called com.spotify.music delete it.\\n7b. Optional: Repeat this for you're using an SD card. The file structure should be the same and the folder will be in SD Card > Android > data.\\n8. Once all this is done, restart your device.\\n9. Open the Google Play Store and install Spotify from there." ],
    "Reinstall iOS": [ "Tech", "The issues you're describing sound like a problem with the cached/temporary data on your device, which can sometimes get damaged over time. I think our best bet would be to do a bit of a specific reinstall of the app that clears out all this data, which is sort of like making the situation brand new again. To do so, you can simply:\\n\\n1. Head to your device's Settings, then tap General.\\n2. Tap iPhone Storage.\\n3. Select Spotify from the list of apps.\\n4. Tap Offload the app and confirm. This will delete the app but its documents data will be kept.\\n5. Then tap Delete App and confirm. This action should delete any leftover documents and data.\\n6. Once the app is deleted, press and hold the Side/Top button and either volume button until the power off slider appears.\\n7. Drag the slider to turn your device completely off.\\n8. After your device turns off, wait a couple of minutes.\\n9. Press and hold the Top (or Side) button again until the display turns on.\\n10. Switch your device back on and install Spotify from the App Store." ],
    "Clear Cache": [ "Tech", "It sounds like the issue may be caused by a fault in the temporary/cached data that Spotify writes to your device, so let's see if clearing the cache helps at all - To do so you can:\\n\\n- Tap the 'Home' button at the bottom of your app\\n- Tap the 'Settings' button which looks like a gear/cogwheel\\n- Tap 'Storage'\\n- Tap 'Delete cache'" ],
    "Check OS And": [ "Tech", "Could you tell me what operating system your Android device is running on? To check that you can simply:\\n\\n- Head to the home screen of your device\\n- Tap 'Settings'\\n- Tap 'About Phone' (or 'About Device')\\n- Take note of the Android Version listed there, or alternatively take a screenshot and send it to me" ],
    "Check OS iOS": [ "Tech", "Could you tell me what operating system your Apple device is running on? To check that you can simply:\\n\\n- Open the 'Settings' app\\n- Tap 'General'\\n- Tap 'About'\\n- Take note of the 'Current iOS Version' listed, or alternatively take a screenshot and send it to me please" ],
    "Logout": [ "Self Serve", "To logout of the app simply:\\n\\n- Tap 'Home' on the bottom of the screen in your app\\n- Tap 'Settings', the icon that looks like a gear in the corner of your screen\\n- Scroll all the way to the bottom\\n- Tap 'Log out'" ],
    "Change Email": [ "Self Serve", "To change your email, you can simply:\\n\\n- Navigate to your account overview found here: https://www.spotify.com/account/overview\\n- Click on 'Edit Profile'\\n- Under 'Email,' enter your new email address\\n- Confirm your Password\\n- Click on 'Save Profile'\\n\\nThen all you have to do is check the confirmation email, and you will be good to go." ],
    "Reset PW": [ "Self Serve", "Simply navigate to http://www.spotify.com/password-reset and fill in your email address - You should get steps to reset your password sent to your email address very soon after!" ],
    "Anon Support": [ "Self Serve", "Without an account you can contact us here: https://support.spotify.com/us/contact-spotify-anonymous/ - Simply write a message and it's good to go!" ],
    "Update Country": [ "Self Serve", "To change your country you can simply:\\n\\n- Navigate to your account overview found here: https://www.spotify.com/account/overview\\n- Click on 'Edit Profile'\\n- Scroll down to where it says 'Country' and select the one you're currently in from the dropdown menu\\n- Click 'Save Profile'\\n\\nDo note that you will have to actually be in the country for the option to show up." ],
    "Change Plan": [ "Self Serve", "All you have to do is:\\n\\n- Navigate to your account overview found here: https://www.spotify.com/account/overview\\n- In the 'Your Plan' section, click 'Change Plan'\\n\\nHere you'll be able to select the one you want!" ],
    "Cancel Sub": [ "Self Serve", "To cancel your subscription, you can:\\n\\n- Navigate to your account overview found here: https://www.spotify.com/account/overview\\n- Scroll down to where it says 'Your Plan,' then click 'Change Plan'\\n- Scroll down to 'Cancel Spotify' and click 'Cancel Premium'\\n\\nAfter you do that, your account will stay Premium for the amount of time that has been paid for, but you will not be billed again." ],
    "Spec. Fix": [ "Self Serve", "With Gmail there's a little trick we can use to free up your address right away:\\n\\n- Navigate to your account overview found here: https://www.spotify.com/account/overview\\n- Click on ''Edit Profile''\\n- Under ''Email,'' edit your Gmail address slightly. Put a dot ''.'' somewhere in the email address before the ''@'' sign, it does not matter where you put it as long as the end result is the same email address, but with a dot somewhere in the username.\\n- Confirm your Password\\n- Click on ''Save Profile''\\n\\nThen your Gmail address will be free to use again!" ],
    "Update Payment": [ "Self Serve", "All you have to do is:\\n\\n- Navigate to your account overview found here: https://www.spotify.com/account/overview\\n- In the 'Your Plan' section, click 'Update'\\n\\nHere you'll be able to enter a new payment method!" ],
    "Disconnected": [ "General", "Just in case we get disconnected, you're welcome to reach out to us again!" ]
  }
}